Repository: im-fitpex/fitpex.ru
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru

source: Switch Language
ru: Переключить язык

source: Welcome!
ru: Добро пожаловать!

source: Home
ru: Главная

source: My Skills
ru: Мои навыки

source: Portfolio
ru: Портфолио

source: Contact Me
ru: Связаться со мной

source: Dark Mode
ru: Тёмная тема

source: An aspiring developer and information security specialist. On this site you can find information about me and my projects.
ru: Начинающий разработчик и специалист по информационной безопасности. На этом сайте вы можете найти информацию обо мне и моих проектах.

source: My skills
ru: Мои навыки

source: Programming
ru: Программирование

source: Python - advanced level
ru: Python - продвинутый уровень

source: C# - basic level
ru: C# - базовый уровень

source: C++ - basic level
ru: C++ - базовый уровень

source: FrontEnd - just4fun
ru: FrontEnd - для удовольствия

source: Cyber Security
ru: Кибербезопасность

source: Self learning since 2018
ru: Самообучение с 2018 года

source: Basics of Cryptography
ru: Основы криптографии

source: Basic web vulnerabilities
ru: Базовые веб-уязвимости

source: Most popular exploits
ru: Самые популярные эксплойты

source: CTF Enjoyer :)
ru: CTF Энтузиаст :)

source: Design
ru: Дизайн

source: Honestly - I'm a total zero in design. You've probably seen that for yourself. 🤗
ru: Честно говоря - я полный ноль в дизайне. Вы, вероятно, сами это видели. 🤗

source: Game Development
ru: Разработка игр

source: I'm still just starting to dive into gamedev. However, I have already made some simple games with Unity and UnrealEngine 4. I will post them on github soon. Maybe :)
ru: Я только начинаю погружаться в геймдев. Однако я уже сделал несколько простых игр на Unity и UnrealEngine 4. Скоро выложу их на github. Может быть :)

source: Communication
ru: Коммуникация

source: I am a fairly outgoing person, able to articulate my thoughts in a relatively clear manner. Moreover, I have a sufficient level of English for communication.
ru: Я довольно общительный человек, способный относительно ясно выражать свои мысли. Более того, у меня достаточный уровень английского для общения.

source: Coming Soon
ru: Скоро будет

source: Welcome to My Portfolio! Please click the button to load the showcase.
ru: Добро пожаловать в моё портфолио! Пожалуйста, нажмите кнопку, чтобы загрузить витрину.

source: Load
ru: Загрузить

source: INITIALIZING
ru: ИНИЦИАЛИЗАЦИЯ

source: Developing a blockchain based on the POW algorithm and creating a website that monitors its performance.
ru: Разработка блокчейна на основе алгоритма POW и создание веб-сайта для мониторинга его производительности.

source: As a result, I became a 2nd degree laureate in the All-Russian competition. The work was presented at a conference in Belarus by other people.
ru: В результате я стал лауреатом 2-й степени Всероссийского конкурса. Работа была представлена на конференции в Беларуси другими людьми.

source: VK GameBot (JS/Python)
ru: VK ИгровойБот (JS/Python)

source: VK gaming bot with daily usage of 300 people per day. The number of registered users was over 700. Originally written with Node JS, later it was completely redesigned in Python. Database changed from JSON to SQLite3.
ru: Игровой бот ВКонтакте с ежедневным использованием 300 человек в день. Количество зарегистрированных пользователей превышало 700. Изначально написан на Node JS, позже был полностью переработан на Python. База данных изменена с JSON на SQLite3.

source: VK ChatManager
ru: VK ЧатМенеджер

source: A bot for moderating large conversations in vk. Warnings, kicks and protection from spam and raid-attacks, alerts from administrators - all this was in one chatbot! The bot also counted the number of messages in the conversation and showed the top participants by messages. One of the distinctive features of the bot was the generation of contextual messages using Markov chains. The project was sold. The peak number of conversations is unknown.
ru: Бот для модерирования больших бесед в вк. Предупреждения, кики и защита от спама и рейд-атак, оповещения от администраторов - всё это было в одном чат-боте! Бот также подсчитывал количество сообщений в беседе и показывал топ участников по сообщениям. Одной из отличительных особенностей бота была генерация контекстных сообщений с использованием цепей Маркова. Проект был продан. Пиковое количество бесед неизвестно.

source: At this point, this site is my latest project. It is up to you to evaluate it! :)
ru: На данный момент этот сайт - мой последний проект. Вам решать, как его оценить! :)

source: Let's Connect
ru: Давайте свяжемся

source: Ready to start a project together? I'd love to hear from you. Send me a message and I'll respond as soon as possible.
ru: Готовы начать проект вместе? Я хотел бы услышать от вас. Отправьте мне сообщение, и я отвечу как можно скорее.

source: Email Me
ru: Напишите мне

source: Connect professionally
ru: Профессиональные связи

source: Check out my code
ru: Посмотрите мой код

source: Your Name
ru: Ваше имя

source: Email Address
ru: Адрес электронной почты

source: Subject
ru: Тема

source: Your Message
ru: Ваше сообщение

source: Send Message
ru: Отправить сообщение
